package lesson5;

public abstract class CarFactory {
    // 1. Создать класс CarFactory, у которого есть два статических методы: создать жигули, создать toyota.
    public void createLada(){
        System.out.println("Создать жигули");
    }
    public void createToyota(){
        System.out.println("Создать тойоту");
    }





}
